{"pages":[{"text":"Information for possible sponsors What is Free/Libre Open Source and Open Knowledge Association of Kansas FLOSOKAKS (openkansas.us)? The Free/Libre Open Source and Open Knowledge Association of Kansas is a new organization in Kansas started with the goal of promoting Free/Libre Open Source Software and Open Knowledge in the state of Kansas. There are a large number of groups in Kansas and the surrounding areas, the FLOSOKAKS will work with them together and aims to create a state wide organization that has members who represent all local groups. You will find a list of groups that we will contact and invite to participate here : http://www.openkansas.us/hacklabscomputer-clubs What is Kansas Linux Fest? Kanas Linux Fest is a new festival of Free/Libre Open Source Software, Open Hardware and Open Knowledge.The Kansas Linux Fest will be held for the first time on the 21st and 22nd of March 2015, in Lawrence Kansas. The goal is to establish a yearly conference where members of the F/LOSS community can meet and share for the Heartland. The next closest Linux Fest is in Ohio and there is no other within 12 hours driving from here.Kansas Linux Fest is organized into two days of talks and workshops in parallel. We will have talks from F/LOSS experts from around the word, from the region and local developers and communities presenting their work. Demand for a conference The F/LOSS community continues to grow, and in Kansas and the surrounding states there is a large amount of activity. The adoption rate of Linux and F/LOSS software is high. The high demand for people with F/LOSS expertise shows that we need to do more here in Kanas to raise awareness about the benefits of this great community. Goals for the conference We want to create a yearly event that helps strengthen the F/LOSS community here in Kansas. Keep costs down for attendees We want to have a free event so that people will not have to pay for entrance fee. We will ask for voluntary donations. Any excess funds from the conference will be used to buy food and drinks for the group. Spending Sponsors help pay for marketing, t-shirts, event space, even coffee/tea and lunches if enough funds are available. We will consider helping pay travel expenses for contributors who otherwise would not be able to attend. Marketing We plan on doing marketing to get the word out, print advertising in regional newspapers, media press releases, posters, online (google, twitter, facebook, linked in) as well as organic marketing efforts. We think that promotion and marketing is very important for the conference and we want to do a great job on that. We will also be printing up posters and flyers to distribute at the cities, schools and universities in Kansas. Design We want to have teeshirts printed and have a nice design for them, ideally for the website as well. We are looking for help on the design side and do not yet have a designer on the project. Website We will want to get ssl certificates and also hosting for a dynamic website for managing the registration of guests, speaker, talks and schedules. Until then we will continue with a static website hosted on github. Sponsorship levels Platinum — USD $3,000 — Gold — USD $2,000 — Silver — USD $1,000 — Your logo or name on the conference shirt (one color only), plus the benefits below. Bronze — USD $250 — Your logo or name in the information booklet and on the webpage page. Your sponsorship is also mentioned by name during Saturday morning's plenary session. Expo Tables We have very limited space for expo tables in the conference room where the talks will be, there we will have some tables on the wall, but that wont have the expo table like atmosphere. We will have space for 3 tables outside in the main hall but only for hacklabs.We will provide tables, trash cans and power for the tables.","tags":"Main","loc":"http://kansaslinuxfest.us/pages/prospectus.html","title":"Prospectus"},{"text":"modified : 2014-10-18 18:00 keywords : Linux, Main a Yearly Open Source (Free/Libre Open Source Software) and Open Knowledge Festival for Kansas This is a project of the Free/Libre Open Source and Open Knowledge Association of Kansas ( www.openkansas.us ) and other organizations. We are still working on the board of directors for the conference and planning. Venue We are very happy to have now confirmed the Lawrence Public Library as our host. Have confirmed the date of 21-22 March 2015. We are looking for sponsors the conference, see our (Prospectus)[/prospectus.html] The Call for papers(Talks) can be found here : CFPWiki and here Lanyrd Connect with us Join the Mailing List Here You can join the call for [papers review team] (https://groups.google.com/forum/#!forum/kansas-linux-fest) Follow the event on lanyrd Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Facebook https://www.facebook.com/flosokaks Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Linked In Follow the Kansas Linux Fest on Facebook https://www.facebook.com/kansaslinux fest Follow the Kansas Linux Fest on Hackaday.io Graphic Arts and webdesign We know that our logo and style is humble, and you are welcome to suggest new logos and styles, just fork the pages on github and send us your ideas! You can the logo on Github Logo On Github Chat with us Join #openkansas and #kansaslinuxfest on irc.freenode.net Please use xchat http://xchat.org/ or For windows , and if possible and stay on the channel, there is not always someone online Kansas Linux Fest is maintained by KansasLinuxFest","tags":"main","loc":"http://kansaslinuxfest.us/kansas-linux-fest.html","title":"Kansas Linux Fest"}]}