{"pages":[{"text":"modified : 2014-10-18 18:00 keywords : Call for Papers, Speakers, Schedule Calendar: talks.ics What is Kansas Linux Fest? Kansas Linux Fest is a new festival of Free/Libre Open Source Software, Open Hardware and Open Knowledge. The Kansas Linux Fest will be held for the first time on the 21st and 22nd of March 2015, in Lawrence Kansas. The goal is to establish a yearly conference where members of the F/LOSS community can meet and share for the Heartland. The next closest Linux Fest is in Ohio and there is no other within 12 hours driving from here. Kansas Linux Fest is organized into two days of talks and workshops in parallel. We will have talks from F/LOSS experts from around the word, from the region and local developers and communities presenting their work. Speakers should be judged by a committee represented by local and international F/LOSS/OK/OH KLF 2015 accepts research papers, industry papers, formal tool demonstrations, lightning talks, new ideas, experience reports, and posters. KLF 2015 also invites proposals for tutorials and workshops, and submissions of panels. Accepted papers will be included in the conference proceedings, which are published online. Topics FLOSS : Free/Libre Open Source Software We are looking for contributions on current trends and development in all areas of Free and Open Source Software, trending new F/LOSS software packages FLOSS technologies, specially those taking advantage of being FLOSS Motivation and incentives to FLOSS development and adoption Business models based on FLOSS and sustainability of FLOSS projects Impact of FLOSS in specific domains or technological areas, and FLOSS adoption Measurement of significant parameters related to FLOSS Open standards, open data, open cloud, open hardware and open exhibits Economic, organizational and social issues on F/LOSS Software development Architecture and design of F/LOSS FLOSS development, including software engineering aspects New experiences with F/LOSS development tools and practices F/LOSS and traditional vs. Agile development methods F/LOSS and decentralized development Reuse in F/LOSS Architecture and design of F/LOSS Operating systems Linux and open source operating system distributions kernel module development tuning of operating systems Driver or library development for embedded systems Linux Kernel Development System Administration Interoperability, portability, scalability of F/LOSS cfengine, puppet, chef, salt, ansible and similar tools Mission-Critical, Real-Time, and Long Life Systems Filesystems And Storage (Long-Term Archiving, Client-Server Filesystems, Compression) Cloud F/LOSS in the cloud F/LOSS in cloud-based applications F/LOSS environments for cloud computing Cloud Containers Cloud Hypervisors Cloud Distributed Services IT security Security of F/LOSS New Research, tools, vulnerabilities, zero days or exploits. local hackers who find innovative tech/non-tech solutions for real-life challenges. known security issues, case studies, twist to an existing research, tool, vulnerability, exploit or research-in-progress security tools Comprises of open source security tools, exploits, frameworks etc. Security aspects of Software Coding, Configuration, Testing Malware F/LOSS platforms and toolkits/Applications F/LOSS for data management and analysis F/LOSS business intelligence toolkits F/LOSS business packages (CRM, ERP, HRM) F/LOSS collaboration and communication environments F/LOSS over the Internet F/LOSS for entertainment F/LOSS for graphics design F/LOSS for 3d animation Software Quality Dynamic F/LOSS verification: F/LOSS testing, debugging, type of tests, use of test suits Static F/LOSS verification - software analysis Formal F/LOSS verification Detection of bad coding practices and adoption of coding conventions F/LOSS metrics: measuring F/LOSS performance, safety, and quality F/LOSS performance Standardization of verification activities and availability of verification results Mobile/Embedded Embedded Systems (Phones and Tablets, Automotive and Self-driving, Yocto, Wearables) Mobile Operating Systems: ROMs, custom images, custom kernels Open Source apps for mobile devices Open Source app markets and software delivery platforms Software metrics for Open Source mobile software Energy efficiency and green solutions in Mobile F/LOSS Software development process for Open Source mobile software Wearable technologies Internet of Everything (Smart Grid, Smart Home, Medical Systems, Environmental Systems) Desktop Porting Proprietary Software to Linux desktop Hardware With Linux Preinstalled Wine and Emulators Influencing Proprietary Companies Review of Linux desktop software Open Knowledge Not just software itself but open knowledge and data are a topic of the conferences. Open Data Crowd-sourcing , citizen science, and crowd-sourcing Collaboration with open data: techniques on modification and sharing Using open data Ethics of privacy and fair usage of data Open Knowledge Knowledge and documentation management in F/LOSS Mapping the movement: What histories can illuminate current open data practice? How should we understand the idea of an open data movement? What can research tell us about the future directions a movement might take? Open data impacts: What impact is open data having in different fields? What methods can be used to trace the impacts of open data? Open data and grassroots communities: What is the impact of open data on grassroots communities, how do they integrate and influence into the open data community? How has open data changed the practices of grassroots movements? Open data internationally: What impact is open data having in different countries? How is open data supporting transparency as well as participatory engagement? Open data and democracy: How is open data being used to support democratic engagement, or impacting upon the democratic sphere? Open data as a tool for research: exploring how open data can be used in research, and tools for open data-driven research. How far are we from a world of free scientific journals? What can be done to get more existing knowledge under a free license? How can we help to preserve and distribute this knowledge, and provide universal access to it? Wikipedia Wiki research: How do wikis, and the Wikimedia wikis in particular, operate? Which processes scale and which ones don't? What kinds of people or social structures are well-suited to wikis? How does introducing a wiki into existing project groups change group dynamics? Wiki sociology: What motivates Wikimedians and what drives them away? Who are they, anyway? And where do they come from? Wiki critics: Critical positions are welcome: why Wikipedia will never be an encyclopedia, why Wikinews can never substitute newspapers, why amateurs shouldn't be allowed to edit, and so forth. Wiki technology ideas: What can we do to address perceived and real problems, for example, peer review? How can we provide better-nuanced or more immediate user feedback? Wiki software ideas: What cutting edge wiki technology is out there? How can wikis be designed to fit better into corporate, political, legal, or other environments? Wiki community ideas: How can we deal with small-scale and large-scale conflicts? How can we bring the community closer together and build a shared belief in our mission? Collaborative writing: What is the status of collaborative writing outside the wiki world (Everything2, H2G2, etc.)? Do wiki projects raise the writing skill of the people involved? Multilingualism: How can wikis help to bridge the subtle culture gaps across languages? How do other international bodies cope with language diversity? What linguistics uses are there for Wikimedia's multilingual corpus? How should we handle minority languages? Making the world's content free! What does this mean? Why is it important? What projects are people working on? Have you done something great with some free content? GLAM & Outreach : Are you working with a GLAM's to release some content or access their expertise? Education Outreach: How can Wikimedia be used in Education? Can students be valuable members of the community? Openstreetmap and FOSS4G (Free and Open Source Software for Geospatial) New developments in F/OSS4G and Openstreetmap Emerging Geospatial technologies Distributed Geo-processing UI\\UX Design (User Interface\\User Experience) Design patterns and best practices for spatial Using F/LOSS4G for humanitarian efforts Use cases for F/LOSS4G F/LOSS4G solutions for specific domains, e.g. remote sensing, climate change analysis, water resources management, disaster response/recovery, and citizen science data collection/dissemination New or underused open Geospatial datasets Data collection techniques Open Hardware Hardware Architectures Maker Culture 3d printing Arduino, Raspberry PI, and other small devices Digital fabrication Manufacturing models A show-and-tell for one of your projects Design techniques Basic electronics for software developers Interfacing with hardware, e.g sensors, actuators, displays, motors, Geiger counters Development environments, software, and tools Working within micro-controller limitations Internet of Things, wearable computing, vehicle telemetry Licensing for hardware The business aspects of Open Hardware Open Society How Free/Libre open source software and open knowledge affect and interact with society. Innovation FLOSS and innovation, how both are related, and new innovation models based on FLOSS Adopting innovation in F/LOSS projects Role of F/LOSS in ICT and sustainable development Expanding scientific research and technology development methods through openness F/LOSS Evaluation, adoption and use Adoption, use and acceptance of F/LOSS Evaluation of F/LOSS software, including comparisons with proprietary software, in industry and government Use and acceptance of F/LOSS; organizational policies The role of F/LOSS-oriented foundations Dissemination, redistribution and crowd-sourcing of F/LOSS systems Role of F/LOSS in ICT and sustainable development Economic, organizational and social issues Economic analysis of F/LOSS and Open Knowledge Maturity models of F/LOSS and Open Knowledge F/LOSS and Open Knowledge in public sector Non-Governmental Organizations and F/LOSS and Open Knowledge Sustainability business models of F/LOSS and Open Knowledge The Business Of Open Source (e.g. Products, Infrastructure, Services, Upstreaming) A11y: Accessibility Access to computing for disabled persons using FLOSS and Open Knowledge Usage of F/LOSS and open data to help people with disabilities Education F/LOSS and Open Knowledge in education Teaching F/LOSS to people of all ages and backgrounds Use of F/LOSS in public schools and the education sector F/LOSS education programs Community Community Building FLOSS communities, including developer, but also user or business communities reports on Promoting F/LOSS in the region status reports of Linux User Groups and other advocacy groups Collaborative Development Government Governance Legal aspects Legal aspects of FLOSS, including copyright and licensing F/LOSS intellectual property, copyrights and licensing F/LOSS Compliance, Patents and Intellectual Property Creative Commons We will pick speakers in this priority : We will have a board of reviewers for the papers and fairly pick the speakers in a transparent manner. 1. National and International F/LOSS/open knowledge/open hardware speakers. 2. Status reports from local and regional hacklabs/lugs/makerspaces etc 3. Local regional developers presenting projects they are working on. Schedule See Schedule Page Venue We have a green room in the auditorium that could serve as a ready room. We have two wireless lavaliere mics and a handheld wireless mic in the auditorium as well as a projector and screen. In Meeting Room C we have a big screen TV that can be connected to a laptop. The room is small enough a mic set up isn't necessary. Register your talk When registering your talk, please indicate your preferred type of talk, time slot, travel plans, any resources needed and contact information. The talk proposals will be sent to our review board via a mailing list, you can join that list if you want to help review papers: Forum Our general list for discussion and announcements is here, please sign up there as well : OrgForum You can email your submission for a talk proposal to : Email Licenses We will publish abstract, description and slides on a website and include the abstract in the conference program. We demand that you place your contributions under the Creative Commons Attribution-ShareAlike 4.0 International cc-by-sa-4.0 license (or a more lenient license.) Unless another license is noted, we will assume that your contribution is under this license. If you want to place your works under a less restrictive license, please note so with your submission. Social The Call for papers(Talks) can be found here as well so that we can be found. This page is the official source. CFPWiki and here Lanyrd Credits Parts of the CFP have been copied from the following sites FROSCON OSSCON15 OKFEST oss2014 foss4g-na wikimania wikimania2015 linuxcon","tags":"pages","loc":"http://kansaslinuxfest.us/pages/call-for-papers.html","title":"Call for Papers"},{"text":"Contributions You are invited to change and submit other designs, source code in svg format images in png hosted on github. Posters Sources Teeshirts designed by @chris-welchhans https://www.behance.net/ChrisWelchhans Sources","tags":"Main","loc":"http://kansaslinuxfest.us/pages/media.html","title":"Media"},{"text":"Information for possible sponsors What is Free/Libre Open Source and Open Knowledge Association of Kansas FLOSOKAKS (openkansas.us)? The Free/Libre Open Source and Open Knowledge Association of Kansas is a new organization in Kansas started with the goal of promoting Free/Libre Open Source Software and Open Knowledge in the state of Kansas. There are a large number of groups in Kansas and the surrounding areas, the FLOSOKAKS will work with them together and aims to create a state wide organization that has members who represent all local groups. You will find a list of groups that we will contact and invite to participate here : http://www.openkansas.us/hacklabscomputer-clubs What is Kansas Linux Fest? Kanas Linux Fest is a new festival of Free/Libre Open Source Software, Open Hardware and Open Knowledge.The Kansas Linux Fest will be held for the first time on the 21st and 22nd of March 2015, in Lawrence Kansas. The goal is to establish a yearly conference where members of the F/LOSS community can meet and share for the Heartland. The next closest Linux Fest is in Ohio and there is no other within 12 hours driving from here.Kansas Linux Fest is organized into two days of talks and workshops in parallel. We will have talks from F/LOSS experts from around the word, from the region and local developers and communities presenting their work. Demand for a conference The F/LOSS community continues to grow, and in Kansas and the surrounding states there is a large amount of activity. The adoption rate of Linux and F/LOSS software is high. The high demand for people with F/LOSS expertise shows that we need to do more here in Kanas to raise awareness about the benefits of this great community. Goals for the conference We want to create a yearly event that helps strengthen the F/LOSS community here in Kansas. Keep costs down for attendees We want to have a free event so that people will not have to pay for entrance fee. We will ask for voluntary donations. Any excess funds from the conference will be used to buy food and drinks for the group. Spending Sponsors help pay for marketing, t-shirts, event space, even coffee/tea and lunches if enough funds are available. We will consider helping pay travel expenses for contributors who otherwise would not be able to attend. Marketing We plan on doing marketing to get the word out, print advertising in regional newspapers, media press releases, posters, online (google, twitter, facebook, linked in) as well as organic marketing efforts. We think that promotion and marketing is very important for the conference and we want to do a great job on that. We will also be printing up posters and flyers to distribute at the cities, schools and universities in Kansas. Design We want to have teeshirts printed and have a nice design for them, ideally for the website as well. We are looking for help on the design side and do not yet have a designer on the project. Website We will want to get ssl certificates and also hosting for a dynamic website for managing the registration of guests, speaker, talks and schedules. Until then we will continue with a static website hosted on github. Sponsorship levels Platinum — USD $3,000 — Gold — USD $2,000 — Silver — USD $1,000 — Your logo or name on the conference shirt (one color only), plus the benefits below. Bronze — USD $250 — Your logo or name in the information booklet and on the webpage page. Your sponsorship is also mentioned by name during Saturday morning's plenary session. Expo Tables We have very limited space for expo tables in the conference room where the talks will be, there we will have some tables on the wall, but that wont have the expo table like atmosphere. We will have space for 3 tables outside in the main hall but only for hacklabs.We will provide tables, trash cans and power for the tables.","tags":"Main","loc":"http://kansaslinuxfest.us/pages/prospectus.html","title":"Prospectus"},{"text":"Calendar The schedule is hosted on http://lanyrd.com/2015/klf15/schedule/ Schedule for Kansas Linux Fest on Lanyrd","tags":"Main","loc":"http://kansaslinuxfest.us/pages/schedule.html","title":"Schedule"},{"text":"Fifty OneFifty kansas based hacker/podcaster/linux guy \"How to Get Yourself On an Open Source Podcast\" Hal Gottfried https://keybase.io/hal9k james o keating james at okeating.net Alan Robertson alanr@unix.sh http://assimilationsystems.com Jonathan George jonathan@jdg.net Wichita \"Crowdfunding, open source, and you. How to make a living doing what you love and giving back.\" http://twitter.com/jdg http://jdg.net Andrew Beals Kansas City * https://plus.google.com/+AndrewBeals Jim Duey Functional-Programming-A-Pragmatic-Introduction http://www.infoq.com/presentations/Functional-Programming-A-Pragmatic-Introduction Andrew Rademacher https://github.com/AndrewRademacher Brian Stinson bstinson.com \"RPM Building 101\" talk/demo for the Kansas Linux Fest. I'm planning to cover the following topics: The Specfile and the corresponding rpmbuild invocations Intermediate tools: (mock) Advanced tools: koji (Fedora and CentOS build systems) I'd like one of the 1 hour slots if possible. Andrew Gill Haskell KU Joe Longstreet Fart Charade: The usefulness of uselessness Michael Goetz Manager, Solutions Engineering mpgoetz@chef.io Alexandru Bardas ksu.edu https://github.com/arguslab/ancor Spencer Hunley https://plus.google.com/+SpencerHunley/posts Topic : accessibility and assistive technology (AT) in Linux Seth Etter Application Developer at BalancedComp Founder of devICT - Wichita Developer Community http://sethetter.com https://twitter.com/sethetter https://devict.org/ Topic: The rise of node and npm Dave Stokes MySQL Community Manager at Oracle https://www.linkedin.com/in/davidmstokes https://twitter.com/stoker * https://opensourcedba.wordpress.com/ Dave Lester Open Source Developer Advocate at Twitter Apache Mesos/Aurora Frank Wiles revsys.com Kevin Lane HP Enterprise Services Omaha Linux Users Group. Linux Certifications I will be discussing the different types of certifications available for Linux, as well as diving into the requirements for each certification, training paths and costs. My goal is twofold, one to educate the community on the different certification paths, and two to provide information on the most cost-effective way to get certified. (with as little money as possible!) Jacob Walker Jacob is a Wichita based software engineer with 5 years of professional experience. He is a co-organizer of devICT, Wichita's developer community. He has been involved in many types of custom software projects and most recently has taken on the role of running Ad Astra Academy, a developer training program in Wichita. http://jacob-walker.com/ https://twitter.com/jcbwlkr https://github.com/jcbwlkr https://www.linkedin.com/in/jcbwlkr Presentation: Getting Started With Go This presentation introduces the programming language Go with an emphasis on what makes the language different, how to get started, and how to be a successful gopher. Jeff Roberson JeffR@hutchgov.com Network Administrator City of Hutchinson www.hutchgov.com I'm the network administrator for the City of Hutchinson and we are running sipXecs which is based on Freeswitch. We have around 250 phones on the system and I didn't know if it would be fitting to have a talk about how the network here was built out to support VoIP as well as a discussion about Asterisk vs Freeswitch and how we decided to use one over the other. I could also discuss the merits of Asterisk and Freeswitch and how one would work better in different situations. Craig Comstock Open Hardware hacking GSM network security hacking via Osmocom Ben C. Roose Systems Administrator for Dept. of Electrical Engineering & Computer Science, Wichita State University, which includes handling a number of departmental Linux servers and Debian-based LTSP (Linux Terminal Server Project) labs. Also the 2014/15 president of the WSU Linux Users Group (WuLUG): https://www.facebook.com/wulug Tutorial on Linux File Access Control An introduction to file and directory permissions in Unix, concepts of the Extend filesystem structure, and basic theory of hard/soft links with practical applications.","tags":"Main","loc":"http://kansaslinuxfest.us/pages/speakers.html","title":"Speakers"},{"text":"Tickets Online Ticketing for Kansas Linux Fest 2015 powered by Eventbrite","tags":"Main","loc":"http://kansaslinuxfest.us/pages/tickets.html","title":"Tickets"},{"text":"modified : 2014-10-18 18:00 keywords : Linux, Main a Yearly Open Source (Free/Libre Open Source Software) and Open Knowledge Festival for Kansas The Kansas Linux Fest will be on March 21-22 at the Lawrence Public Library. Status This is a project of the Free/Libre Open Source and Open Knowledge Association of Kansas ( www.openkansas.us ) and other organizations. We are still working on the board of directors for the conference and planning. Venue We are very happy to have now confirmed the Lawrence Public Library as our host. Have confirmed the date of 21-22 March 2015. We are looking for sponsors the conference, see our /prospectus.html The Call for papers(Talks) can be found here : CFPWiki and here Lanyrd Connect with us Join the flosokaks Mailing List for Kansas topics You can join the call for Kansas Linux Fest Mailing list Follow the event on lanyrd Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Facebook https://www.facebook.com/flosokaks Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Linked In Follow the Kansas Linux Fest on Facebook https://www.facebook.com/kansaslinux fest Follow the Kansas Linux Fest on Hackaday.io Graphic Arts and webdesign We know that our logo and style is humble, and you are welcome to suggest new logos and styles, just fork the pages on github and send us your ideas! You can find the logo on Github Logo On Github Chat with us Join #openkansas and #kansaslinuxfest on irc.freenode.net Please use xchat http://xchat.org/ or For windows , and if possible and stay on the channel, there is not always someone online Kansas Linux Fest is maintained by KansasLinuxFest","tags":"main","loc":"http://kansaslinuxfest.us/kansas-linux-fest.html","title":"Kansas Linux Fest"}]}