{"pages":[{"text":"modified : 2015-03-22 11:00 keywords : Breakfast, Calendar, Schedule Eat and Greet Kansas Linux Fest Sponsored by Rackspace Join us for a full breakfast buffet open to all attendees and hear from Rackspace Principal Engineer Alex Juarez. We'll be talking all things Linux, Apache, MySQL, Chef, Ansible, SaltStack and Hosting. @alex_juarez Register here, limited to max 70 people. Full Breakfast Buffet Sunday, March 22nd 9am-11am Maceli's 1031 New Hampshire St macelis Full Breakfast Buffet - Pancakes - Hash Browns - Bacon & Sausage - Fruit Salad - Scrambled Eggs or Quiche pdf","tags":"pages","loc":"http://kansaslinuxfest.us/pages/breakfast.html","title":"Breakfast"},{"text":"Email Email Voicemail A google voice mailbox is setup to recieve messages (908) 989-0434 Event Location The event will be held at the Lawrence Public Library Address: 707 Vermont St, Lawrence, KS 66044 Phone: (785) 843-3833 Website Mailing list our mailing lists: The event mailing list Kansas Linux Fest Mailing list The Open Kansas organization mailing list flosokaks Mailing List for Kansas topics IRC Chat Join #openkansas and #kansaslinuxfest on irc.freenode.net you can use WebChat to connect as well. Social Media Follow the event on lanyrd Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Facebook https://www.facebook.com/flosokaks Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Linked In Follow the Kansas Linux Fest on Facebook https://www.facebook.com/kansaslinux fest Follow the Kansas Linux Fest on Hackaday.io","tags":"Main","loc":"http://kansaslinuxfest.us/pages/contact.html","title":"Contact"},{"text":"See the press release <{filename}/press.md>`_ Contributions You are invited to change and submit other designs, source code in svg format images in png hosted on github. Posters Sources Teeshirts designed by @chris-welchhans https://www.behance.net/ChrisWelchhans Sources","tags":"Main","loc":"http://kansaslinuxfest.us/pages/media-and-press.html","title":"Media and Press"},{"text":"Calendar The schedule is hosted on http://lanyrd.com/2015/klf15/schedule/ Schedule for Kansas Linux Fest on Lanyrd","tags":"Main","loc":"http://kansaslinuxfest.us/pages/schedule.html","title":"Schedule"},{"text":"Fifty OneFifty kansas based hacker/podcaster/linux guy \"How to Get Yourself On an Open Source Podcast\" Hal Gottfried https://keybase.io/hal9k james o keating james at okeating.net Alan Robertson alanr@unix.sh http://assimilationsystems.com Jonathan George jonathan@jdg.net Wichita \"Crowdfunding, open source, and you. How to make a living doing what you love and giving back.\" http://twitter.com/jdg http://jdg.net Andrew Beals Kansas City * https://plus.google.com/+AndrewBeals Jim Duey Functional-Programming-A-Pragmatic-Introduction http://www.infoq.com/presentations/Functional-Programming-A-Pragmatic-Introduction Andrew Rademacher https://github.com/AndrewRademacher Brian Stinson bstinson.com \"RPM Building 101\" talk/demo for the Kansas Linux Fest. I'm planning to cover the following topics: The Specfile and the corresponding rpmbuild invocations Intermediate tools: (mock) Advanced tools: koji (Fedora and CentOS build systems) I'd like one of the 1 hour slots if possible. Andrew Gill Haskell KU Joe Longstreet Fart Charade: The usefulness of uselessness Michael Goetz Manager, Solutions Engineering mpgoetz@chef.io Alexandru Bardas ksu.edu https://github.com/arguslab/ancor Spencer Hunley https://plus.google.com/+SpencerHunley/posts Topic : accessibility and assistive technology (AT) in Linux Seth Etter Application Developer at BalancedComp Founder of devICT - Wichita Developer Community http://sethetter.com https://twitter.com/sethetter https://devict.org/ Topic: The rise of node and npm Dave Stokes MySQL Community Manager at Oracle https://www.linkedin.com/in/davidmstokes https://twitter.com/stoker * https://opensourcedba.wordpress.com/ Dave Lester Open Source Developer Advocate at Twitter Apache Mesos/Aurora Frank Wiles revsys.com Kevin Lane HP Enterprise Services Omaha Linux Users Group. Linux Certifications I will be discussing the different types of certifications available for Linux, as well as diving into the requirements for each certification, training paths and costs. My goal is twofold, one to educate the community on the different certification paths, and two to provide information on the most cost-effective way to get certified. (with as little money as possible!) Jacob Walker Jacob is a Wichita based software engineer with 5 years of professional experience. He is a co-organizer of devICT, Wichita's developer community. He has been involved in many types of custom software projects and most recently has taken on the role of running Ad Astra Academy, a developer training program in Wichita. http://jacob-walker.com/ https://twitter.com/jcbwlkr https://github.com/jcbwlkr https://www.linkedin.com/in/jcbwlkr Presentation: Getting Started With Go This presentation introduces the programming language Go with an emphasis on what makes the language different, how to get started, and how to be a successful gopher. Jeff Roberson JeffR@hutchgov.com Network Administrator City of Hutchinson www.hutchgov.com I'm the network administrator for the City of Hutchinson and we are running sipXecs which is based on Freeswitch. We have around 250 phones on the system and I didn't know if it would be fitting to have a talk about how the network here was built out to support VoIP as well as a discussion about Asterisk vs Freeswitch and how we decided to use one over the other. I could also discuss the merits of Asterisk and Freeswitch and how one would work better in different situations. Craig Comstock Open Hardware hacking GSM network security hacking via Osmocom Ben C. Roose Systems Administrator for Dept. of Electrical Engineering & Computer Science, Wichita State University, which includes handling a number of departmental Linux servers and Debian-based LTSP (Linux Terminal Server Project) labs. Also the 2014/15 president of the WSU Linux Users Group (WuLUG): https://www.facebook.com/wulug Tutorial on Linux File Access Control An introduction to file and directory permissions in Unix, concepts of the Extend filesystem structure, and basic theory of hard/soft links with practical applications.","tags":"Main","loc":"http://kansaslinuxfest.us/pages/speakers.html","title":"Speakers"},{"text":"Tickets Online Ticketing for Kansas Linux Fest 2015 powered by Eventbrite","tags":"Main","loc":"http://kansaslinuxfest.us/pages/tickets.html","title":"Tickets"},{"text":"modified : 2014-10-18 18:00 keywords : Linux, Main a Yearly Open Source (Free/Libre Open Source Software) and Open Knowledge Festival for Kansas The Kansas Linux Fest will be on March 21-22 at the Lawrence Public Library. Status This is a project of the Free/Libre Open Source and Open Knowledge Association of Kansas ( www.openkansas.us ) and other organizations. We are still working on the board of directors for the conference and planning. Venue We are very happy to have now confirmed the Lawrence Public Library as our host. Have confirmed the date of 21-22 March 2015. We are looking for sponsors the conference, see our /prospectus.html The Call for papers(Talks) can be found here : CFPWiki and here Lanyrd Connect with us Join the flosokaks Mailing List for Kansas topics You can join the call for Kansas Linux Fest Mailing list Follow the event on lanyrd Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Facebook https://www.facebook.com/flosokaks Follow the Free/Libre Open Source Software and Open Knowledge Association of Kansas on Linked In Follow the Kansas Linux Fest on Facebook https://www.facebook.com/kansaslinux fest Follow the Kansas Linux Fest on Hackaday.io Graphic Arts and webdesign We know that our logo and style is humble, and you are welcome to suggest new logos and styles, just fork the pages on github and send us your ideas! You can find the logo on Github Logo On Github Chat with us Join #openkansas and #kansaslinuxfest on irc.freenode.net Please use xchat http://xchat.org/ or For windows , and if possible and stay on the channel, there is not always someone online Kansas Linux Fest is maintained by KansasLinuxFest","tags":"main","loc":"http://kansaslinuxfest.us/kansas-linux-fest.html","title":"Kansas Linux Fest"}]}